ГТС/УТГТС/InformationRegisters/ПодтверждениеОплатыНДСВБюджет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПодтверждениеОплатыНДСВБюджет</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерОтметкиОРегистрации</Name>
					<Comment>Номер отметки о регистрации заявления в налоговом органе</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПодтвержденияОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтрокаПлатежноРасчетныеДокументы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидАгентскогоДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыАгентскихДоговоров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаявкаНаРасходованиеДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплатаЧерезЕдиныйЛицевойСчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СчетФактура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СчетФактура</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОплатыНДСВБюджет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРегистратор</Name>
					<Comment>Документ, по которому сформирована запись</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерДокументаПеречисленияНалога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаДокументаПеречисленияНалога</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ГТС/УТГТС/Enums/ВидыЦенностей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыЦенностей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АвансыВыданные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвансыПолученные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвансыПолученные0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееПотребление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возврат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратАвансовПолученных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИмуществоСУчетомНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомандировочныеРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалоговыйАгентАренда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалоговыйАгентРеализацияИмущества</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалоговыйАгентИностранцы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалоговыйАгентЭлектронныеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалоговыйАгентКомитент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НМА</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбъектыНезавершенногоСтроительства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПосредническиеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредставительскиеРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРаботыИУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СМРПодрядные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СМРСобственнымиСилами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммыСвязанныеСРасчетамиПоОплате</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТаможенныеПлатежи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТаможенныеПлатежиОС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Товары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТаможенныйСоюз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварыНалоговыйАгент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвансыВыданныеНалоговыйАгент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвансыПолученныеНалоговыйАгент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратАвансовПолученныхНалоговыйАгент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронныеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УслугиНеНаТерриторииРФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВосстановлениеПоКСФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеверсивноеОбложениеНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварыФизлицамВЕАЭСЭлектронныеПлощадки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СМРПодрядныеКапстроительство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КапстроительствоНезавершенныхОбъектов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/InformationRegisters/ПодтверждениеОплатыНДСВБюджет/Forms/ФормаДокументыОплаты/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СчетФактура = Параметры.СчетФактура;
	
	Если ТипЗнч(СчетФактура) = Тип("ДокументСсылка.ПервичныйДокумент") Тогда
		ЭтоЗаявлениеОВвозе = (РегистрыСведений.ПодтверждениеОплатыНДСВБюджет.ВидЦенностиВводОстатков(СчетФактура) = Перечисления.ВидыЦенностей.ТаможенныйСоюз);
	Иначе
		ЭтоЗаявлениеОВвозе = (ТипЗнч(СчетФактура) = Тип("ДокументСсылка.ЗаявлениеОВвозеТоваров"));
	КонецЕсли;
	ЭтоНалоговыйАгент = (ТипЗнч(СчетФактура) = Тип("ДокументСсылка.СчетФактураНалоговыйАгент"));
	СуммаНДСПоДокументу = РегистрыСведений.ПодтверждениеОплатыНДСВБюджет.ПолучитьСуммуНДСКОплатеВБюджет(СчетФактура);
	
	ДанныеОплат = РегистрыСведений.ПодтверждениеОплатыНДСВБюджет.ПолучитьДанныеОплат(СчетФактура);
	Для Каждого СтрокаТаблицыОплат Из ДанныеОплат Цикл
		СтрокаОплаты = ДокументыОплаты.Добавить();
		СтрокаОплаты.Сумма 					= СтрокаТаблицыОплат.Сумма;
		СтрокаОплаты.Дата 					= СтрокаТаблицыОплат.ДатаДокументаПеречисленияНалога;
		СтрокаОплаты.Номер 					= СтрокаТаблицыОплат.НомерДокументаПеречисленияНалога;
		СтрокаОплаты.РучнаяКорректировка 	= СтрокаТаблицыОплат.РучнаяКорректировка;
		СтрокаОплаты.ДатаПеречисленияНалога = СтрокаТаблицыОплат.ДатаПодтвержденияОплаты;
	КонецЦикла;
	
	Если ЭтоЗаявлениеОВвозе Тогда
		ДанныеОтметки = РегистрыСведений.ПодтверждениеОплатыНДСВБюджет.ПолучитьДанныеОтметкиНалоговогоОргана(СчетФактура);
		Если ДанныеОтметки <> Неопределено Тогда
			ОплатаПодтверждена = Истина;
			НомерОтметкиОРегистрации = ДанныеОтметки.НомерОтметкиОРегистрации;
			ДатаПодтвержденияОплаты = ДанныеОтметки.ДатаПодтвержденияОплаты;
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтоЗаявлениеОВвозе ИЛИ ЭтоНалоговыйАгент Тогда
		Элементы.ФормаЗаполнить.Заголовок = НСтр("ru = 'Заполнить по оплатам в бюджет'");
	Иначе
		Элементы.ФормаЗаполнить.Заголовок = НСтр("ru = 'Заполнить по расчетам с таможней'");
	КонецЕсли;
	
	УстановитьТекстПодсказки(ЭтотОбъект);	
	
	УстановитьВидимостьДоступностьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ОплатаПодтверждена Тогда
	    ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("НомерОтметкиОРегистрации"));
	    ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ДатаПодтвержденияОплаты"));
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из ДокументыОплаты Цикл
		НомерСтроки = ДокументыОплаты.Индекс(СтрокаТЧ)+1;
		Если Не ЗначениеЗаполнено(СтрокаТЧ.Номер) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтрШаблон(НСтр("ru = 'В строке %1 не заполнен номер документа перечисления налога'"), НомерСтроки),
				,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ДокументыОплаты", НомерСтроки, "Номер"),
				,
				Отказ);
	    КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаТЧ.Дата) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтрШаблон(НСтр("ru = 'В строке %1 не заполнена дата документа перечисления налога'"), НомерСтроки),
				,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ДокументыОплаты", НомерСтроки, "Дата"),
				,
				Отказ);
	    КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаТЧ.Сумма) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтрШаблон(НСтр("ru = 'В строке %1 не заполнена сумма НДС'"), НомерСтроки),
				,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ДокументыОплаты", НомерСтроки, "Сумма"),
				,
				Отказ);
	    КонецЕсли;
		Если ЭтоНалоговыйАгент И Не ЗначениеЗаполнено(СтрокаТЧ.ДатаПеречисленияНалога) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтрШаблон(НСтр("ru = 'В строке %1 не заполнена дата перечисления налога'"), НомерСтроки),
				,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ДокументыОплаты", НомерСтроки, "ДатаПеречисленияНалога"),
				,
				Отказ);
	    КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОплатаПодтвержденаПриИзменении(Элемент)
	
	УстановитьВидимостьДоступностьЭлементов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДокументыОплаты

&НаКлиенте
Процедура ДокументыОплатыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если Не ОтменаРедактирования Тогда
		Элемент.ТекущиеДанные.РучнаяКорректировка = 1;
	КонецЕсли;
	УстановитьТекстПодсказки(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОплатыДатаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДокументыОплаты.ТекущиеДанные;
	
	Если Не ЭтоНалоговыйАгент ИЛИ ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.ДатаПеречисленияНалога = ТекущиеДанные.Дата;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	ЗаполнитьПоДаннымРасчетовНаСервере();
	УстановитьТекстПодсказки(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	ОчиститьСообщения();
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ОповеститьОВыборе(ЗаписатьНаСервере());
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьТекстПодсказки(Форма)
	
	ТекстСообщенияОплаченоПолностью = НСтр("ru='Всего перечислено в бюджет [Оплачено] руб.
		|Это соответствует сумме НДС по документу.'");
	ТекстСообщенияОсталосьОплатить = НСтр("ru='Всего перечислено в бюджет [Оплачено] руб.
		|Осталось перечислить [Осталось] руб.'");
	
	СуммаОплачено = Форма.ДокументыОплаты.Итог("Сумма");
	
	Если Форма.СуммаНДСПоДокументу = СуммаОплачено Тогда
		НадписьПеречисленоВБюджет = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(
			ТекстСообщенияОплаченоПолностью, 
			Новый Структура("Оплачено", СуммаОплачено));
	Иначе
		НадписьПеречисленоВБюджет = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(
			ТекстСообщенияОсталосьОплатить, 
			Новый Структура("Оплачено,Осталось", 
				СуммаОплачено, 
				Форма.СуммаНДСПоДокументу - СуммаОплачено));
	КонецЕсли;
			
	Форма.НадписьОплачено = НадписьПеречисленоВБюджет;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступностьЭлементов()
	
	Элементы.ДатаПодтвержденияОплаты.Видимость = ОплатаПодтверждена;
	Элементы.НомерОтметкиОРегистрации.Видимость = ОплатаПодтверждена;
	Элементы.ГруппаПодтвержденияОплаты.Видимость = ЭтоЗаявлениеОВвозе;
	Элементы.ДокументыОплатыДатаПеречисленияНалога.Видимость = ЭтоНалоговыйАгент;
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьНаСервере()

	Если ЭтаФорма.Модифицированность Тогда
		РегистрыСведений.ПодтверждениеОплатыНДСВБюджет.ЗаписатьДанныеОплаты(СчетФактура, ДокументыОплаты.Выгрузить());
	КонецЕсли;

	Если ЭтоЗаявлениеОВвозе Тогда
		РегистрыСведений.ПодтверждениеОплатыНДСВБюджет.ЗаписатьПодтверждениеОплаты(СчетФактура, 
																				   ОплатаПодтверждена,
																				   НомерОтметкиОРегистрации,
																				   ДатаПодтвержденияОплаты);
		ЗаявлениеОВвозеЛокализация.СформироватьДвиженияВЖурналУчетаСчетовФактур(СчетФактура);
	КонецЕсли;
	
	Возврат РегистрыСведений.ПодтверждениеОплатыНДСВБюджет.ТекстСостояниеОплатыНДСВБюджет(СчетФактура);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПоДаннымРасчетовНаСервере()
	
	ТаблицаОплат = РегистрыСведений.ПодтверждениеОплатыНДСВБюджет.СформироватьТаблицуОплатНДСВБюджет(СчетФактура, ДокументыОплаты.Выгрузить());
	
	ДокументыОплаты.Загрузить(ТаблицаОплат);	
	
КонецПроцедуры

#КонецОбласти
